HeRCLab/Droneproj/libraries/AP_HAL_ESP32/hwdef/esp32s3_wroom1_n16r8/sdkconfig.defaults
# ==== Target & CPU ====
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# ==== PSRAM (SPIRAM) ====
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_USE_MALLOC_CAPS=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL=y
# Optional stability tweaks:
CONFIG_ESP_SYSTEM_MEMPROT_FEATURE=n
CONFIG_SPIRAM_MEMTEST=n

# ==== Flash size (16MB) ====
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# ==== Partition table: single-app (big app slot) ====
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_singleapp.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ==== Console over USB-Serial-JTAG (typical S3 dev boards) ====
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_NONE=n

# ==== Logging (keep reasonable; can lower if RAM gets tight) ====
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

